clear all; clc

%% 1. 숫자 1~100까지의 합을 구하세요.
v_1 = 1:100;
result_1 = sum(v_1);

%% 2. 숫자 1에서부터 99가 될 때까지 2씩 증가하는 수로 이루어진 3×3행렬 50개의 합을 구하세요.
% 구현해야 하는건 1부터 99까지 더하고, 그 나온 값을 3x3 행렬에 넣어주면 된다. 
a = 1:2:99; 
a_sum = sum(a);
result_2 = ones(3,3) * a_sum;


% 결과적으로 나와야 하는건 3x3 행렬, 그리고 숫자 i는 1부터 99까지 2씩 증가한다.
% 이런 측면에서 바라보면, zeros를 통해 3x3 행렬 생성 후 i=1,3,5,...,99 순회하며, 
% i번째 항목에 해당하는 수를 ones(3,3)에 곱하고, 결과로 나와야 할 zeros(3,3)에
% 누적하며 더하는 방식이 존재하지 않을까? 
result_3 = zeros(3,3);

for i = 1:2:99
    M = ones(3, 3) * i;
    result_3 = result_3 + M;
end

result_3;







